#pragma once
#include "../../dependencies/math/math.hpp"
#include <array>
#include "collideable.hpp"
#include "client_class.hpp"
#include "../structs/animstate.hpp"

#include "../../dependencies/utilities/netvars/netvars.hpp"
#include "../../core/features/inventory_changer/CEconItem.h"

namespace csgo {
	extern player_t * local_player;

	extern  bool in_
		[ 65 ];
}
enum data_update_type_t {
	DATA_UPDATE_CREATED = 0,
	DATA_UPDATE_DATATABLE_CHANGED,
};

enum cs_weapon_type {
	WEAPONTYPE_KNIFE = 0,
	WEAPONTYPE_PISTOL,
	WEAPONTYPE_SUBMACHINEGUN,
	WEAPONTYPE_RIFLE,
	WEAPONTYPE_SHOTGUN,
	WEAPONTYPE_SNIPER_RIFLE,
	WEAPONTYPE_MACHINEGUN,
	WEAPONTYPE_C4,
	WEAPONTYPE_PLACEHOLDER,
	WEAPONTYPE_GRENADE,
	WEAPONTYPE_UNKNOWN
};

enum client_frame_stage_t {
	FRAME_UNDEFINED = -1,			// (haven't run any frames yet)
	FRAME_START,

	// A network packet is being recieved
	FRAME_NET_UPDATE_START,
	// Data has been received and we're going to start calling PostDataUpdate
	FRAME_NET_UPDATE_POSTDATAUPDATE_START,
	// Data has been received and we've called PostDataUpdate on all data recipients
	FRAME_NET_UPDATE_POSTDATAUPDATE_END,
	// We've received all packets, we can now do interpolation, prediction, etc..
	FRAME_NET_UPDATE_END,

	// We're about to start rendering the scene
	FRAME_RENDER_START,
	// We've finished rendering the scene.
	FRAME_RENDER_END
};
enum InvalidatePhysicsBits_t : int {
	POSITION_CHANGED = 0x1,
	ANGLES_CHANGED = 0x2,
	VELOCITY_CHANGED = 0x4,
	ANIMATION_CHANGED = 0x8,
	BOUNDS_CHANGED = 0x10,
	SEQUENCE_CHANGED = 0x20
};

enum move_type {
	movetype_none = 0,
	movetype_isometric,
	movetype_walk,
	movetype_step,
	movetype_fly,
	movetype_flygravity,
	movetype_vphysics,
	movetype_push,
	movetype_noclip,
	movetype_ladder,
	movetype_observer,
	movetype_custom,
	movetype_last = movetype_custom,
	movetype_max_bits = 4,
	max_movetype
};

enum entity_flags {
	fl_onground = ( 1 << 0 ),
	fl_ducking = ( 1 << 1 ),
	fl_waterjump = ( 1 << 2 ),
	fl_ontrain = ( 1 << 3 ),
	fl_inrain = ( 1 << 4 ),
	fl_frozen = ( 1 << 5 ),
	fl_atcontrols = ( 1 << 6 ),
	fl_client = ( 1 << 7 ),
	fl_fakeclient = ( 1 << 8 ),
	fl_inwater = ( 1 << 9 ),
	fl_fly = ( 1 << 10 ),
	fl_swim = ( 1 << 11 ),
	fl_conveyor = ( 1 << 12 ),
	fl_npc = ( 1 << 13 ),
	fl_godmode = ( 1 << 14 ),
	fl_notarget = ( 1 << 15 ),
	fl_aimtarget = ( 1 << 16 ),
	fl_partialground = ( 1 << 17 ),
	fl_staticprop = ( 1 << 18 ),
	fl_graphed = ( 1 << 19 ),
	fl_grenade = ( 1 << 20 ),
	fl_stepmovement = ( 1 << 21 ),
	fl_donttouch = ( 1 << 22 ),
	fl_basevelocity = ( 1 << 23 ),
	fl_worldbrush = ( 1 << 24 ),
	fl_object = ( 1 << 25 ),
	fl_killme = ( 1 << 26 ),
	fl_onfire = ( 1 << 27 ),
	fl_dissolving = ( 1 << 28 ),
	fl_transragdoll = ( 1 << 29 ),
	fl_unblockable_by_player = ( 1 << 30 )
};

enum item_definition_indexes {
	weapon_deagle = 1,
	weapon_elite = 2,
	weapon_fiveseven = 3,
	weapon_glock = 4,
	weapon_ak47 = 7,
	weapon_aug = 8,
	weapon_awp = 9,
	weapon_famas = 10,
	weapon_g3sg1 = 11,
	weapon_galilar = 13,
	weapon_m249 = 14,
	weapon_m4a1 = 16,
	weapon_mac10 = 17,
	weapon_p90 = 19,
	weapon_mp5sd = 23,
	weapon_ump45 = 24,
	weapon_xm1014 = 25,
	weapon_bizon = 26,
	weapon_mag7 = 27,
	weapon_negev = 28,
	weapon_sawedoff = 29,
	weapon_tec9 = 30,
	weapon_taser = 31,
	weapon_hkp2000 = 32,
	weapon_mp7 = 33,
	weapon_mp9 = 34,
	weapon_nova = 35,
	weapon_p250 = 36,
	weapon_scar20 = 38,
	weapon_sg556 = 39,
	weapon_ssg08 = 40,
	weapon_knifegg = 41,
	weapon_knife = 42,
	weapon_flashbang = 43,
	weapon_hegrenade = 44,
	weapon_smokegrenade = 45,
	weapon_molotov = 46,
	weapon_decoy = 47,
	weapon_incgrenade = 48,
	weapon_c4 = 49,
	weapon_knife_t = 59,
	weapon_m4a1_silencer = 60,
	weapon_usp_silencer = 61,
	weapon_cz75a = 63,
	weapon_revolver = 64,
	weapon_knife_bayonet = 500,
	weapon_knife_flip = 505,
	weapon_knife_gut = 506,
	weapon_knife_karambit = 507,
	weapon_knife_m9_bayonet = 508,
	weapon_knife_tactical = 509,
	weapon_knife_falchion = 512,
	weapon_knife_bowie = 514,
	weapon_knife_butterfly = 515,
	weapon_knife_shadowdaggers = 516,
	weapon_knife_navaja = 520,
	weapon_knife_stiletto = 522,
	weapon_knife_ursus = 519,
	weapon_knife_widowmaker = 523
};

struct bbox_t {
	int x, y, w, h;
	bbox_t ( ) = default;
	bbox_t ( int x, int y, int w, int h ) {
		this->x = x;
		this->y = y;
		this->w = w;
		this->h = h;
	}
};
struct RenderableInstance_t {
	uint8_t m_alpha;
	__forceinline RenderableInstance_t ( ) : m_alpha { 255ui8 } { }
};



class entity_t {
public:
	void * animating ( ) {
		return reinterpret_cast< void * >( uintptr_t ( this ) + 0x4 );
	}
	i_client_renderable * get_renderable_virtual ( void ) {
		return ( i_client_renderable * ) ( ( uintptr_t ) this + 0x4 );
	}

	bool IsStandable ( )  {
		if ( this->collideable()->GetSolidFlags ( ) & FSOLID_NOT_STANDABLE )
			return false;

		if ( this->collideable ( )->GetSolid ( ) == SOLID_BSP || this->collideable ( )->GetSolid ( ) == SOLID_VPHYSICS || this->collideable ( )->GetSolid ( ) == SOLID_BBOX )
			return true;

		return IsBSPModel ( );
	}

	bool IsBSPModel ( )  {
		if ( this->collideable ( )->GetSolid ( ) == SOLID_BSP )
			return true;

	
		if ( this->collideable ( )->GetSolid ( ) == SOLID_VPHYSICS && interfaces::model_info->get_model_type ( this->model() ) == mod_brush )
			return true;

		return false;
	}


	matrix3x4_t & coord_frame ( ) {
		const static auto m_CollisionGroup = netvar_manager::get_net_var ( fnv::hash ( "DT_BaseEntity" ), fnv::hash ( "m_CollisionGroup" ) );

		auto m_rgflCoordinateFrame = m_CollisionGroup - 0x30;

		return *reinterpret_cast< matrix3x4_t * >( reinterpret_cast< uintptr_t >( this ) + m_rgflCoordinateFrame );
	}

	NETVAR ( "DT_BaseCSGrenadeProjectile", "m_vInitialVelocity", m_vInitialVelocity, vec3_t );
	NETVAR ( "DT_BaseEntity", "m_iHealth", m_iHealth, int );
	NETVAR ( "DT_BaseEntity", "m_vecMins", mins, vec3_t );
	NETVAR ( "DT_BaseEntity", "m_vecMaxs", maxs, vec3_t );
	NETVAR ( "DT_BaseEntity", "m_vecBaseVelocity", m_vecBaseVelocity, vec3_t );
	
	NETVAR ( "DT_SmokeGrenadeProjectile", "m_bDidSmokeEffect", m_bDidSmokeEffect, bool );
	NETVAR ( "DT_CSRagdoll", "m_hPlayer", m_hPlayer, void* );
	NETVAR ( "DT_SmokeGrenadeProjectile", "m_nSmokeEffectTickBegin", m_nSmokeEffectTickBegin, int );
	NETVAR ( "DT_SmokeGrenadeProjectile", "m_nExplodeEffectTickBegin", m_nExplodeEffectTickBegin, int );
	
	NETVAR (  "DT_Inferno", "m_fireXDelta", fireXDelta, int* );
	NETVAR (  "DT_Inferno", "m_fireYDelta", fireYDelta, int * );
	NETVAR (  "DT_Inferno", "m_fireZDelta", fireZDelta, int * );
	NETVAR (  "DT_Inferno", "m_bFireIsBurning", fireIsBurning, bool* );
	NETVAR (  "DT_Inferno", "m_fireCount", fireCount, int );

	int get_sequence_act ( int sequence ) {
		const auto model = this->model ( );
		if ( !model )
			return -1;
		static auto get_sequence_act_pattern = utilities::pattern_scan ( "client.dll", "55 8B EC 53 8B 5D 08 56 8B F1 83" );
		const auto hdr = interfaces::model_info->get_studio_model ( model );
		if ( !hdr )
			return -1;

		static auto get_sequence_act = reinterpret_cast< int ( __fastcall * )( void *, studio_hdr_t *, int ) >( get_sequence_act_pattern );
		return get_sequence_act ( this, hdr, sequence );
	}
	void * networkable ( ) {
		return reinterpret_cast< void * >( uintptr_t ( this ) + 0x8 );
	}
	collideable_t * collideable ( ) {
		using original_fn = collideable_t * ( __thiscall * )( void * );
		return ( *( original_fn ** ) this ) [ 3 ] ( this );
	}
	c_client_class * client_class ( ) {
		using original_fn = c_client_class * ( __thiscall * )( void * );
		return ( *( original_fn ** ) networkable ( ) ) [ 2 ] ( networkable ( ) );
	}

	int index ( ) {
		using original_fn = int ( __thiscall * )( void * );
		return ( *( original_fn ** ) networkable ( ) ) [ 10 ] ( networkable ( ) );
	}
	inline const char * get_classname ( void ) {
		return ( ( const char * ( __thiscall * )( entity_t * ) ) * ( uintptr_t * ) ( *( uintptr_t * ) this + 556 ) )( this );
	}

	bool is_player ( ) {
		using original_fn = bool ( __thiscall * )( entity_t * );
		return ( *( original_fn ** ) this ) [158] ( this );
	}
	bool is_weapon ( ) {
		using original_fn = bool ( __thiscall * )( entity_t * );
		return ( *( original_fn ** ) this ) [166] ( this );
	}
	vec3_t get_absolute_origin ( ) {
		__asm {
			MOV ECX, this
			MOV EAX, DWORD PTR DS : [ECX]
			CALL DWORD PTR DS : [EAX + 0x28]
		}
	}
	vec3_t  get_render_origin ( ) {
		using original_fn = vec3_t  ( __thiscall * )( void * );
		return ( *( original_fn ** ) animating ( ) ) [ 1 ] ( animating ( ) );
	}

	
	bool setup_bones_alternative ( BoneArray * out, int max_bones, int mask, float time ) {
		if ( !this )
			return false;

		using original_fn = bool ( __thiscall * )( void *, BoneArray *, int, int, float );
		return ( *( original_fn ** ) animating ( ) ) [ 13 ] ( animating ( ), out, max_bones, mask, time );
	}


	/*__forceinline IClientUnknown * GetIClientUnknown ( ) {
		return utilities::get_virtual_function< IClientUnknown * ( __thiscall * )( void * ) > ( networkable ( ), 0 )( networkable ( ) );
	}
	__forceinline unsigned long GetRefEHandle ( ) {
		if ( !this->GetIClientUnknown ( ) )
			return NULL;

		return this->GetIClientUnknown ( )->GetRefEHandle ( );
	}*/
	model_t * model ( ) {
		using original_fn = model_t * ( __thiscall * )( void * );
		return ( *( original_fn ** ) animating ( ) ) [ 8 ] ( animating ( ) );
	}
	void update ( ) {
		using original_fn = void ( __thiscall * )( entity_t * );
		( *( original_fn ** ) this ) [ 218 ] ( this );
	}
	int draw_model ( int flags, uint8_t alpha ) {
		using original_fn = int ( __thiscall * )( void *, int, uint8_t );
		return ( *( original_fn ** ) animating ( ) ) [ 9 ] ( animating ( ), flags, alpha );
	}
	void set_angles ( vec3_t angles ) {
		using original_fn = void ( __thiscall * )( void *, const vec3_t & );
		static original_fn set_angles_fn = ( original_fn ) ( ( DWORD ) utilities::pattern_scan ( "client.dll", "55 8B EC 83 E4 F8 83 EC 64 53 56 57 8B F1" ) );
		set_angles_fn ( this, angles );
	}
	void set_position ( vec3_t position ) {
		using original_fn = void ( __thiscall * )( void *, const vec3_t & );
		static original_fn set_position_fn = ( original_fn ) ( ( DWORD ) utilities::pattern_scan ( "client.dll", "55 8B EC 83 E4 F8 51 53 56 57 8B F1 E8" ) );
		set_position_fn ( this, position );
	}



	void set_model_index ( int index ) {
		using original_fn = void ( __thiscall * )( void *, int );
		return ( *( original_fn ** ) this ) [ 75 ] ( this, index );
	}

	void net_pre_data_update ( int update_type ) {
		using original_fn = void ( __thiscall * )( void *, int );
		return ( *( original_fn ** ) networkable ( ) ) [ 6 ] ( networkable ( ), update_type );
	}

	void net_release ( ) {
		using original_fn = void ( __thiscall * )( void * );
		return ( *( original_fn ** ) networkable ( ) ) [ 1 ] ( networkable ( ) );
	}
	void set_local_viewangles ( vec3_t & angle ) {
		( ( void ( __thiscall * )( void *, vec3_t & ) ) get_vfunc ( this, 372 ) )( this, angle );
	}
	int net_set_destroyed_on_recreate_entities ( ) {
		using original_fn = int ( __thiscall * )( void * );
		return ( *( original_fn ** ) networkable ( ) ) [ 13 ] ( networkable ( ) );
	}
	float & get_old_simulation_time ( void ) {
		static auto	offset = netvar_manager::get_net_var ( fnv::hash ( "DT_BaseEntity" ), fnv::hash ( "m_flSimulationTime" ) );

		return *( float * ) ( ( uintptr_t ) this + offset + 0x4 );
	}

	OFFSET ( float, get_spawn_time, 0x20 );

	NETVAR ( "DT_CSPlayer", "m_fFlags", flags, int );
	OFFSET ( bool, dormant, 0xED );
	OFFSET ( int, get_take_damage, 0x27C )
	OFFSET ( vec3_t, old_origin, 0x3A8 );
	NETVAR ( "DT_BaseEntity", "m_hOwnerEntity", owner_handle, unsigned long );
	NETVAR ( "DT_BaseEntity", "m_hOwner", original_owner_handle, unsigned long );
	NETVAR ( "DT_BaseEntity", "m_flSimulationTime", simulation_time, float );
	OFFSET ( float, m_flVelocityModifier, 0xA38C );
	NETVAR ( "DT_BaseEntity", "m_vecOrigin", origin, vec3_t );

	NETVAR ( "DT_BaseEntity", "m_vecVelocity[0]", vec_velocity, vec3_t );

	NETVAR ( "DT_BasePlayer", "m_vecViewOffset[0]", view_offset, vec3_t );
	NETVAR ( "DT_CSPlayer", "m_iTeamNum", team, int );
	NETVAR ( "DT_BaseEntity", "m_bSpotted", spotted, bool );
	NETVAR ( "DT_CSPlayer", "m_nSurvivalTeam", survival_team, int );

	NETVAR ( "DT_CSPlayer", "m_flHealthShotBoostExpirationTime", health_boost_time, float );



};

class econ_view_item_t {
public:
	NETVAR ( "DT_ScriptCreatedItem", "m_bInitialized", is_initialized, bool );
	NETVAR ( "DT_ScriptCreatedItem", "m_iEntityLevel", entity_level, int );
	NETVAR ( "DT_ScriptCreatedItem", "m_iAccountID", account_id, int );
	NETVAR ( "DT_ScriptCreatedItem", "m_iItemIDLow", item_id_low, int );
};

class IRefCounted {
private:
	volatile long refCount;

public:
	virtual void destructor ( char bDelete ) = 0;
	virtual bool OnFinalRelease ( ) = 0;

	void unreference ( ) {
		if ( InterlockedDecrement ( &refCount ) == 0 && OnFinalRelease ( ) ) {
			destructor ( 1 );
		}
	}
};
class C_EconItemDefinition {
public:
	/*char pad_0x0000 [ 0x8 ]; ///0x0000
	int32_t m_iItemDefinitionIndex; ///0x0008 
	char pad_0x000C [ 0x40 ]; ///0x000C
	char * m_szHudName; ///0x004C 
	char pad_0x0050 [ 0x4 ]; ///0x0050
	char * m_szWeaponType; ///0x0054 
	char pad_0x0058 [ 0x4 ]; ///0x0058
	char * m_szWeaponDescription; ///0x005C 
	char pad_0x0060 [ 0x34 ]; ///0x0060
	char * m_szViewModel; ///0x0094 
	char pad_0x0098 [ 0x4 ]; ///0x0098
	char * m_szWorldModel; ///0x009C 
	char * m_szWorldModelDropped; ///0x00A0 
	char pad_0x00A4 [ 0x110 ]; ///0x00A4
	char * m_szWeaponName1; ///0x01B4 
	char pad_0x01B8 [ 0x8 ]; ///0x01B8
	char * m_szWeaponName; ///0x01C0 
	char pad_0x01C4 [ 0x27C ]; ///0x01C4*/

	int GetEquippedPosition ( ) {
		return *reinterpret_cast< int * >( ( uintptr_t ) this + 0x28C );
	}
}; ///Size=0x0440
class C_EconItemView {
private:
	using str_32 = char [ 32 ];
public:
	NETVAR2 ( int32_t, m_bInitialized, "DT_BaseAttributableItem", "m_bInitialized" );
	NETVAR2 ( int32_t, m_iItemDefinitionIndex, "DT_BaseAttributableItem", "m_iItemDefinitionIndex" );
	NETVAR2 ( int32_t, m_iEntityLevel, "DT_BaseAttributableItem", "m_iEntityLevel" );
	NETVAR2 ( int32_t, m_iAccountID, "DT_BaseAttributableItem", "m_iAccountID" );
	NETVAR2 ( int32_t, m_iItemIDLow, "DT_BaseAttributableItem", "m_iItemIDLow" );
	NETVAR2 ( int32_t, m_iItemIDHigh, "DT_BaseAttributableItem", "m_iItemIDHigh" );
	NETVAR2 ( int32_t, m_iEntityQuality, "DT_BaseAttributableItem", "m_iEntityQuality" );
	NETVAR2 ( str_32, m_iCustomName, "DT_BaseAttributableItem", "m_szCustomName" );

	c_utl_vector<IRefCounted *> & m_CustomMaterials ( );
